W4D4/skeleton/app/controllers/cat_rental_requests_controller.rb

INSERT INTO "cat_rental_requests" ("cat_id", "created_at", "end_date", "start_date", "status", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["cat_id", 2], ["created_at", "2016-10-05 23:57:29.345476"], ["end_date", "2016-10-03"], ["start_date", "2016-10-01"], ["status", "PENDING"], ["updated_at", "2016-10-05 23:57:29.345476"]]
---
  def create
    @rental_request = CatRentalRequest.new(cat_rental_request_params)
    if current_user
      @rental_request.user_id = current_user.id

      if @rental_request.save