W4D4/skeleton/app/controllers/cats_controller.rb

INSERT INTO "cats" ("birth_date", "color", "created_at", "description", "name", "sex", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @cat = Cat.new(cat_params)
    if current_user
      @cat.user_id = current_user.id

      if @cat.save

SELECT  "cats".* FROM "cats"  WHERE "cats"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "cats" SET "description" = $1, "updated_at" = $2 WHERE "cats"."id" = 1  [["description", "aksdjfkl;asdf;jasdgkaghraeurgqiutn39q48htgqierung;lasdf"], ["updated_at", "2016-10-05 22:49:06.680288"]]
---
  def update
    @cat = Cat.find(params[:id])
    if @cat.update_attributes(cat_params)