W4D4/skeleton/app/views/cats/show.html.erb

  </tr>
  <% @cat.rental_requests.order("start_date").includes(:user).each do |req| %>
---
SELECT "cat_rental_requests".* FROM "cat_rental_requests"  WHERE "cat_rental_requests"."cat_id" = $1  ORDER BY start_date  [["cat_id", 1]]
SELECT "users".* FROM "users"  WHERE "users"."id" IN (4)